alibaba/AliOS-Things/platform/mcu/lpc54102/drivers/fsl_spi.c
    /* Pause the SPI FIFO for setting. */
    while (
        !((VFIFO->FIFOCTLSPI & VFIFO_FIFOCTLSPI_RXPAUSED_MASK) && (VFIFO->FIFOCTLSPI & VFIFO_FIFOCTLSPI_TXPAUSED_MASK)))
    {
        VFIFO->FIFOCTLSPI |= (VFIFO_FIFOCTLSPI_RXPAUSE_MASK | VFIFO_FIFOCTLSPI_TXPAUSE_MASK);
    }

    /* Flush the  TX and RX FIFO buffer. */
    SPI_FifoFlush(base, kSPI_FifoTx | kSPI_FifoRx);
    /* Set the TX and RX FIFO size to zero. */
    VFIFO->FIFOCFGSPI[instance] = VFIFO_FIFOCFGSPI_RXSIZE(0U) | VFIFO_FIFOCFGSPI_TXSIZE(0U);
    /* Update all the SPI FIFO size. */
    VFIFO->FIFOUPDATESPI |= VFIFO_FIFOUPDATESPI_SPI0RXUPDATESIZE_MASK | VFIFO_FIFOUPDATESPI_SPI0TXUPDATESIZE_MASK |
                            VFIFO_FIFOUPDATESPI_SPI1RXUPDATESIZE_MASK | VFIFO_FIFOUPDATESPI_SPI1TXUPDATESIZE_MASK;
    /* Disable all FIFO interrupts. */
    SPI_DisableFifoInterrupts(base, kSPI_AllFifoInterruptEnable);
    /* Clear all FIFO status flags, only receive timeout and bus error flag can be cleared. */
    SPI_ClearFifoStatusFlags(base, kSPI_RxFifoTimeOutFlag | kSPI_FifoBusErrorFlag);
    /* Unpause the system FIFO for transfer. */
    VFIFO->FIFOCTLSPI &= ~(VFIFO_FIFOCTLSPI_RXPAUSE_MASK | VFIFO_FIFOCTLSPI_TXPAUSE_MASK);

    /* Disable the TX/RX FIFO for tansfer. */
    switch (instance)
    {
        case 0:
            SYSCON->FIFOCTRL &= ~(SYSCON_FIFOCTRL_SPI0TXFIFOEN_MASK | SYSCON_FIFOCTRL_SPI0RXFIFOEN_MASK);
            break;
        case 1:
            SYSCON->FIFOCTRL &= ~(SYSCON_FIFOCTRL_SPI1TXFIFOEN_MASK | SYSCON_FIFOCTRL_SPI1RXFIFOEN_MASK);
            break;
        default:
            break;
    }
}
/* Check if TX FIFO enabled. */
bool SPI_IsTxFifoEnabled(SPI_Type *base)
{
    uint32_t instance = SPI_GetInstance(base);
    uint32_t fifosize = VFIFO->FIFOCFGSPI[instance];

    /* Check if system FIFO control TX is enabled. */
    switch (instance)
    {
        case 0:
            if (SYSCON->FIFOCTRL & SYSCON_FIFOCTRL_SPI0TXFIFOEN_MASK)
            {
                break;
            }
            else
            {
                return false;
            }
        case 1:
            if (SYSCON->FIFOCTRL & SYSCON_FIFOCTRL_SPI1TXFIFOEN_MASK)
            {
                break;
            }
            else
            {
                return false;
            }
        default:
            break;
    }

    /* Check if TX FIFO size is available. */
    return (fifosize & VFIFO_FIFOCFGSPI_TXSIZE_MASK) ? (true) : (false);
}

/* Check if RX FIFO enabled. */
bool SPI_IsRxFifoEnabled(SPI_Type *base)
{
    uint32_t instance = SPI_GetInstance(base);
    uint32_t fifosize = VFIFO->FIFOCFGSPI[instance];

    /* Check if system FIFO control RX is enabled. */
    switch (instance)
    {
        case 0:
            if (SYSCON->FIFOCTRL & SYSCON_FIFOCTRL_SPI0RXFIFOEN_MASK)
            {
                break;
            }
            else
            {
                return false;
            }
        case 1:
            if (SYSCON->FIFOCTRL & SYSCON_FIFOCTRL_SPI1RXFIFOEN_MASK)
            {
                break;
            }
            else
            {
                return false;
            }
        default:
            break;
    }

    /* Check if RX FIFO size is available. */
    return (fifosize & VFIFO_FIFOCFGSPI_RXSIZE_MASK) ? (true) : (false);
}

static void SPI_SendTransfer(SPI_Type *base, spi_master_handle_t *handle)
{
    uint32_t tx_ctrl = 0U, last_ctrl = 0U;
    uint32_t tmp32 = 0U;
    uint32_t instance = SPI_GetInstance(base);

    /* Select slave to talk with */
    tx_ctrl |= (SPI_DEASSERT_ALL & (~SPI_DEASSERT_SSELNUM(g_configs[instance].sselNum)));
    /* Set width of data - range asserted at entry */
    tx_ctrl |= SPI_TXDATCTL_LEN(handle->dataWidth);
    /* If the control flag is different with configuration. */
    if (handle->configFlags !=
        (base->TXCTL & SPI_TXDATCTL_RXIGNORE_MASK & SPI_TXDATCTL_EOT_MASK & SPI_TXDATCTL_EOF_MASK))
    {
        /* Delay end of frame.*/
        tx_ctrl |= (handle->configFlags & (uint32_t)kSPI_FrameDelay) ? (uint32_t)kSPI_FrameDelay : 0;
        /* Ignore the receive.*/
        tx_ctrl |= (handle->configFlags & SPI_TXDATCTL_RXIGNORE_MASK);
    }
    last_ctrl = tx_ctrl;
    if (handle->configFlags & SPI_TXDATCTL_EOT_MASK)
    {
        last_ctrl |= SPI_TXDATCTL_EOT_MASK;
    }

    if (handle->isTxFifoEnabled)
    {
        /* Fill data to tx fifo buffer until the tx threshold reached flag cleard. */
        while ((VFIFO->SPI[instance].STATSPI & VFIFO_SPI_STATSPI_TXTH_MASK) && (handle->txRemainingBytes))
        {
            if (handle->txData)
            {
                tmp32 = *(handle->txData++);
                handle->txRemainingBytes--;
                if (handle->dataWidth > 7U)
                {
                    tmp32 |= ((uint32_t)(*(handle->txData++)) << 8U);
                    handle->txRemainingBytes--;
                }
            }
            else
            {
                tmp32 = ((uint32_t)s_dummyData[instance] << 8U) | s_dummyData[instance];
                handle->txRemainingBytes--;
                if (handle->dataWidth > 7U)
                {
                    handle->txRemainingBytes--;
                }
            }
            /* If this transmit is the last to send, Set the control bits and disable Tx interrupt. */
            if (handle->txRemainingBytes == 0U)
            {
                VFIFO->SPI[instance].TXDATSPI = (tmp32 | last_ctrl);
                SPI_DisableFifoInterrupts(base, kSPI_TxFifoThresholdInterruptEnable);
            }
            else
            {
                VFIFO->SPI[instance].TXDATSPI = (tmp32 | tx_ctrl);
            }
        }
    }
    else
    {
        /* If transmit is ready, write data once to TXDATCTL register. */
        if ((kSPI_TxReadyFlag & SPI_GetStatusFlags(base)) && (handle->txRemainingBytes))
        {
            if (handle->txData)
            {
                tmp32 = *(handle->txData++);
                handle->txRemainingBytes--;
                if (handle->dataWidth > 7U)
                {
                    tmp32 |= ((uint32_t)(*(handle->txData++)) << 8U);
                    handle->txRemainingBytes--;
                }
            }
            else
            {
                tmp32 = ((uint32_t)s_dummyData[instance] << 8U) | s_dummyData[instance];
                handle->txRemainingBytes--;
                if (handle->dataWidth > 7U)
                {
                    handle->txRemainingBytes--;
                }
            }
            /* If this transmit is the last to send, Set the control bits and disable Tx interrupt. */
            if (handle->txRemainingBytes == 0U)
            {
                base->TXDATCTL = (tmp32 | last_ctrl);
                SPI_DisableInterrupts(base, kSPI_TxReadyInterruptEnable);
            }
            base->TXDATCTL = (tmp32 | tx_ctrl);
        }
    }
}

static void SPI_ReceiveTransfer(SPI_Type *base, spi_master_handle_t *handle)
{
    uint32_t tmp32 = 0U;
    uint32_t instance = SPI_GetInstance(base);

    if (handle->isRxFifoEnabled)
    {
        /* Read data from fifo buffer until the rx fifo is empty or to receive bytes is zero. */
        while ((!(VFIFO->SPI[instance].STATSPI & VFIFO_SPI_STATSPI_RXEMPTY_MASK)) && (handle->rxRemainingBytes))
        {
            tmp32 = VFIFO->SPI[instance].RXDATSPI;
            /* Check If receive buffer is NULL. */
            if (handle->rxData)
            {
                *(handle->rxData++) = tmp32;
                if (handle->dataWidth > 7U)
                {
                    *(handle->rxData++) = (tmp32 >> 8U);
                }
            }
            handle->rxRemainingBytes--;
            if (handle->dataWidth > 7U)
            {
                handle->rxRemainingBytes--;
            }
        }
    }
    else
    {
        /* If receive is ready, read data from RXDAT register. */
        if ((kSPI_RxReadyFlag & SPI_GetStatusFlags(base)) && (handle->rxRemainingBytes))
        {
            tmp32 = (base->RXDAT & 0x0000FFFFU);
            /* Check If receive buffer is NULL. */
            if (handle->rxData)
            {
                *(handle->rxData++) = tmp32;
                if (handle->dataWidth > 7U)
                {
                    *(handle->rxData++) = (tmp32 >> 8U);
                }
            }
            handle->rxRemainingBytes--;
            if (handle->dataWidth > 7U)
            {
                handle->rxRemainingBytes--;
            }
        }
    }
}

/* Set delay time for SPI transfer. */
void SPI_SetTransferDelay(SPI_Type *base, const spi_delay_config_t *config)
{
    assert(NULL != config);
    /* Clear the DLY register. */
    base->DLY &=
        ~(SPI_DLY_PRE_DELAY_MASK | SPI_DLY_POST_DELAY_MASK | SPI_DLY_FRAME_DELAY_MASK | SPI_DLY_TRANSFER_DELAY_MASK);
    /* Set the delay configuration. */
    base->DLY |= (SPI_DLY_PRE_DELAY(config->preDelay) | SPI_DLY_POST_DELAY(config->postDelay) |
                  SPI_DLY_FRAME_DELAY(config->frameDelay) | SPI_DLY_TRANSFER_DELAY(config->transferDelay));
}
void SPI_MasterGetDefaultConfig(spi_master_config_t *config)
{
    assert(NULL != config);

    config->enableLoopback = false;
    config->enableMaster = true;
    config->polarity = kSPI_ClockPolarityActiveHigh;
    config->phase = kSPI_ClockPhaseFirstEdge;
    config->direction = kSPI_MsbFirst;
    config->baudRate_Bps = 500000U;
    config->dataWidth = kSPI_Data8Bits;
    config->sselNum = kSPI_Ssel0;
    config->sselPol = kSPI_SpolActiveAllLow;
    config->fifoConfig.enableRxFifo = false;
    config->fifoConfig.enableTxFifo = false;
    config->fifoConfig.rxFifoSize = 8U;
    config->fifoConfig.txFifoSize = 8U;
    config->fifoConfig.rxFifoThreshold = 0U;
    config->fifoConfig.txFifoThreshold = 1U;
    config->delayConfig.frameDelay = 0U;
    config->delayConfig.postDelay = 0U;
    config->delayConfig.preDelay = 0U;
    config->delayConfig.transferDelay = 0U;
}

status_t SPI_MasterInit(SPI_Type *base, const spi_master_config_t *config, uint32_t srcClock_Hz)
{
    int32_t result = 0, instance = 0;
    uint32_t tmp = 0U;

