alibaba/AliOS-Things/platform/mcu/lpc54102/drivers/fsl_spi.c
    /* DataSize (in bytes) is not aligned to 16bit (2B) transfer */
    if ((dataWidth > kSPI_Data8Bits) && (xfer->dataSize & 0x1))
    {
        return kStatus_InvalidArgument;
    }

    /* Select slave to talk with */
    tx_ctrl |= (SPI_DEASSERT_ALL & (~SPI_DEASSERT_SSELNUM(g_configs[instance].sselNum)));
    /* Set width of data - range asserted at entry */
    tx_ctrl |= SPI_TXDATCTL_LEN(dataWidth);
    /* Delay end of transfer */
    tx_ctrl |= (xfer->configFlags & (uint32_t)kSPI_FrameDelay) ? (uint32_t)kSPI_FrameDelay : 0;
    /* Ignore the receive.*/
    tx_ctrl |= (xfer->configFlags & SPI_TXDATCTL_RXIGNORE_MASK);

    last_ctrl = tx_ctrl;
    /* End of transfer */
    last_ctrl |= (xfer->configFlags & (uint32_t)kSPI_FrameAssert) ? (uint32_t)kSPI_FrameAssert : 0;

    if (!isTxFifoEnabled)
    {
        base->TXCTL = tx_ctrl;
    }

    /* Last index of loop */
    while (remainingBytes)
    {
        tmp32 = 0U;
        /* Wait for Transmit is ready. */
        if (isTxFifoEnabled)
        {
            while (!(VFIFO->SPI[instance].STATSPI & VFIFO_SPI_STATSPI_TXEMPTY_MASK))
            {
            }
        }
        else
        {
            while (!(base->STAT & SPI_STAT_TXRDY_MASK))
            {
            }
        }
        /* If txdata is not NULL. */
        if (xfer->txData)
        {
            tmp32 = *(xfer->txData++);
            if (dataWidth > 7U)
            {
                tmp32 |= ((uint32_t)(*(xfer->txData++))) << 8U;
            }
        }
        else
        {
            tmp32 = ((uint32_t)s_dummyData[instance] << 8U) | s_dummyData[instance];
        }
        if ((dataWidth > 7) ? (remainingBytes == 2U) : (remainingBytes == 1U))
        {
            if (isTxFifoEnabled)
            {
                VFIFO->SPI[instance].TXDATSPI = (tmp32 | last_ctrl);
            }
            else
            {
                base->TXDATCTL = (tmp32 | last_ctrl);
            }
        }
        else
        {
            if (isTxFifoEnabled)
            {
                VFIFO->SPI[instance].TXDATSPI = (tmp32 | tx_ctrl);
            }
            else
            {
                /* Write data to the Transmit register. */
                base->TXDAT = tmp32;
            }
        }

        /* Read data from the receive register. */
        if (isRxFifoEnabled)
        {
            while ((VFIFO->SPI[instance].STATSPI & VFIFO_SPI_STATSPI_RXEMPTY_MASK))
            {
            }
            tmp32 = VFIFO->SPI[instance].RXDATSPI;
        }
        else
        {
            while (!(base->STAT & SPI_STAT_RXRDY_MASK))
            {
            }
            tmp32 = base->RXDAT;
        }
        /* If receive buffer is NULL. */
        if (xfer->rxData)
        {
            *(xfer->rxData++) = tmp32;
            if (dataWidth > 7U)
            {
                *(xfer->rxData++) = (tmp32 >> 8U);
            }
        }

        remainingBytes--;
        if (dataWidth > 7U)
        {
            remainingBytes--;
        }
    }

    return kStatus_Success;
}

status_t SPI_MasterTransferNonBlocking(SPI_Type *base, spi_master_handle_t *handle, spi_transfer_t *xfer)
{
    /* check params */
    assert(
        !((NULL == base) || (NULL == handle) || (NULL == xfer) || ((NULL == xfer->txData) && (NULL == xfer->rxData))));
    if ((NULL == base) || (NULL == handle) || (NULL == xfer) || ((NULL == xfer->txData) && (NULL == xfer->rxData)))
    {
        return kStatus_InvalidArgument;
    }

    /* dataSize (in bytes) is not aligned to 16bit (2B) transfer */
    if ((handle->dataWidth > kSPI_Data8Bits) && (xfer->dataSize & 0x1))
    {
        return kStatus_InvalidArgument;
    }

    /* Check if SPI is busy */
    if (handle->state == kStatus_SPI_Busy)
    {
        return kStatus_SPI_Busy;
    }

    /* Set the handle information */
    handle->txData = xfer->txData;
    handle->rxData = xfer->rxData;
    /* Set count */
    handle->txRemainingBytes = xfer->dataSize;
    handle->rxRemainingBytes = xfer->dataSize;
    handle->totalByteCount = xfer->dataSize;
    /* Other options */
    handle->configFlags = xfer->configFlags;
    /* Set the SPI state to busy */
    handle->state = kStatus_SPI_Busy;
    /* FIFO options. */
    if (SPI_IsTxFifoEnabled(base))
    {
        SPI_EnableFifoInterrupts(base, kSPI_TxFifoThresholdInterruptEnable);
    }
    else
    {
        /* Enable generating txIRQ, first transfer is fired by TX ready interrupt. */
        SPI_EnableInterrupts(base, kSPI_TxReadyInterruptEnable);
    }
    if (SPI_IsRxFifoEnabled(base))
    {
        SPI_EnableFifoInterrupts(base, kSPI_RxFifoThresholdInterruptEnable);
    }
    else
    {
        /* Enable generating rxIRQ. */
        SPI_EnableInterrupts(base, kSPI_RxReadyInterruptEnable);
    }
    return kStatus_Success;
}

status_t SPI_MasterHalfDuplexTransferBlocking(SPI_Type *base, spi_half_duplex_transfer_t *xfer)
{
    assert(xfer);

    spi_transfer_t tempXfer = {0};
    status_t status;

    if (xfer->isTransmitFirst)
    {
        tempXfer.txData = xfer->txData;
        tempXfer.rxData = NULL;
        tempXfer.dataSize = xfer->txDataSize;
    }
    else
    {
        tempXfer.txData = NULL;
        tempXfer.rxData = xfer->rxData;
        tempXfer.dataSize = xfer->rxDataSize;
    }
    /* If the pcs pin keep assert between transmit and receive. */
    if (xfer->isPcsAssertInTransfer)
    {
        tempXfer.configFlags = (xfer->configFlags) & (uint32_t)(~kSPI_FrameAssert);
    }
    else
    {
        tempXfer.configFlags = (xfer->configFlags) | kSPI_FrameAssert;
    }

    status = SPI_MasterTransferBlocking(base, &tempXfer);

    if (status != kStatus_Success)
    {
        return status;
    }

    if (xfer->isTransmitFirst)
    {
        tempXfer.txData = NULL;
        tempXfer.rxData = xfer->rxData;
        tempXfer.dataSize = xfer->rxDataSize;
    }
    else
    {
        tempXfer.txData = xfer->txData;
        tempXfer.rxData = NULL;
        tempXfer.dataSize = xfer->txDataSize;
    }
    tempXfer.configFlags = xfer->configFlags;

    /* SPI transfer blocking. */
    status = SPI_MasterTransferBlocking(base, &tempXfer);

