alibaba/AliOS-Things/platform/mcu/lpc54102/drivers/fsl_spi.c
    return status;
}

status_t SPI_MasterHalfDuplexTransferNonBlocking(SPI_Type *base,
                                                 spi_master_handle_t *handle,
                                                 spi_half_duplex_transfer_t *xfer)
{
    assert(xfer);
    assert(handle);
    spi_transfer_t tempXfer = {0};
    status_t status;

    if (xfer->isTransmitFirst)
    {
        tempXfer.txData = xfer->txData;
        tempXfer.rxData = NULL;
        tempXfer.dataSize = xfer->txDataSize;
    }
    else
    {
        tempXfer.txData = NULL;
        tempXfer.rxData = xfer->rxData;
        tempXfer.dataSize = xfer->rxDataSize;
    }
    /* If the pcs pin keep assert between transmit and receive. */
    if (xfer->isPcsAssertInTransfer)
    {
        tempXfer.configFlags = (xfer->configFlags) & (uint32_t)(~kSPI_FrameAssert);
    }
    else
    {
        tempXfer.configFlags = (xfer->configFlags) | kSPI_FrameAssert;
    }

    status = SPI_MasterTransferBlocking(base, &tempXfer);
    if (status != kStatus_Success)
    {
        return status;
    }

    if (xfer->isTransmitFirst)
    {
        tempXfer.txData = NULL;
        tempXfer.rxData = xfer->rxData;
        tempXfer.dataSize = xfer->rxDataSize;
    }
    else
    {
        tempXfer.txData = xfer->txData;
        tempXfer.rxData = NULL;
        tempXfer.dataSize = xfer->txDataSize;
    }
    tempXfer.configFlags = xfer->configFlags;

    status = SPI_MasterTransferNonBlocking(base, handle, &tempXfer);

    return status;
}

status_t SPI_SlaveTransferNonBlocking(SPI_Type *base, spi_slave_handle_t *handle, spi_transfer_t *xfer)
{
    status_t status = 0U;

    status = SPI_MasterTransferNonBlocking(base, handle, xfer);
    if (kStatus_Success != status)
    {
        return status;
    }
    s_spiSlaveIsr = SPI_SlaveTransferHandleIRQ;

    return kStatus_Success;
}
status_t SPI_MasterTransferGetCount(SPI_Type *base, spi_master_handle_t *handle, size_t *count)
{
    assert(NULL != handle);

    if (!count)
    {
        return kStatus_InvalidArgument;
    }

    /* Catch when there is not an active transfer. */
    if (handle->state != kStatus_SPI_Busy)
    {
        *count = 0;
        return kStatus_NoTransferInProgress;
    }

    *count = handle->totalByteCount - handle->rxRemainingBytes;
    return kStatus_Success;
}

void SPI_MasterTransferAbort(SPI_Type *base, spi_master_handle_t *handle)
{
    assert(NULL != handle);

    /* Disable interrupt requests*/
    if (SPI_IsTxFifoEnabled(base))
    {
        SPI_DisableFifoInterrupts(base, kSPI_TxFifoThresholdInterruptEnable);
    }
    else
    {
        SPI_DisableInterrupts(base, kSPI_TxReadyInterruptEnable);
    }
    if (SPI_IsRxFifoEnabled(base))
    {
        SPI_DisableFifoInterrupts(base, kSPI_RxFifoThresholdInterruptEnable);
    }
    else
    {
        SPI_DisableInterrupts(base, kSPI_RxReadyInterruptEnable);
    }

    handle->state = kStatus_SPI_Idle;
    handle->txRemainingBytes = 0;
    handle->rxRemainingBytes = 0;
}

void SPI_MasterTransferHandleIRQ(SPI_Type *base, spi_master_handle_t *handle)
{
    assert((NULL != base) && (NULL != handle));
    uint32_t instance = SPI_GetInstance(base);

    /* IRQ behaviour:
     * - first interrupt is triggered by transmit ready interrupt or tx threshold reached if
     *   FIFO is enabled. The transfer function then tries read data and transmit data
     *   interleaved that results to strategy to process as many items as possible.
     * - last interrupt is triggered by receive data ready. The last state is
     *   known by empty rxBuffer and txBuffer. If there is nothing to receive
     *   or send - both operations have been finished and interrupts can be disabled.
     * - Note(case with the fifo used): Because the SPI0 and SPI1 share the same tx buffer and
     *   rx buffer, So the threshold interrupt may occured but the data in the buffer
     *   for SPIx may not reach the threshold separately if SPI0 and SPI1 are receiving
     *   data at the same time. The similar issue may happen when SPI0 and SPI1 are sending
     *   data at the same time with the FIFO used.
     */

    /* Data to send or read or expected to receive */
    if (handle->rxRemainingBytes)
    {
        SPI_ReceiveTransfer(base, handle);
    }
    if (handle->txRemainingBytes)
    {
        SPI_SendTransfer(base, handle);
    }
    if ((0U == handle->txRemainingBytes) && (0U == handle->rxRemainingBytes))
    {
        if (SPI_IsRxFifoEnabled(base))
        {
            SPI_EnableFifoInterrupts(base, kSPI_RxFifoThresholdInterruptEnable);
        }
        else
        {
            /* Disable TX and RX interrupt. */
            SPI_DisableInterrupts(base, kSPI_RxReadyInterruptEnable);
        }
        /* Set transfer state to idle. */
        handle->state = kStatus_SPI_Idle;
        /* If callback is not NULL, call this function. */
        if (handle->callback)
        {
            (handle->callback)(base, handle, handle->state, handle->userData);
        }
    }
    /* Check when the last receive, if the rx threshold can be triggered with the fifo enabled. */
    if (SPI_IsRxFifoEnabled(base))
    {
        /* If the bytes to receive is not larger then the rx threshold, the interrupt will not be triggerred.
         * So need to reload the rx threshold value to trigger the last receive.
         */
        if ((handle->rxRemainingBytes != 0U) && (handle->rxRemainingBytes <= handle->rxFifoThreshold))
        {
            VFIFO->SPI[instance].CFGSPI = ((VFIFO->SPI[instance].CFGSPI & ~VFIFO_SPI_CFGSPI_RXTHRESHOLD_MASK) |
                                           VFIFO_SPI_CFGSPI_RXTHRESHOLD(handle->rxRemainingBytes - 1));
        }
        /* If the rx threshold value in the register is not the default value in handle. Reload it to default value. */
        if ((handle->rxRemainingBytes == 0U) && (SPI_FIFO_GETRXTHRESHOLD(base) != handle->rxFifoThreshold))
        {
            VFIFO->SPI[instance].CFGSPI = ((VFIFO->SPI[instance].CFGSPI & ~VFIFO_SPI_CFGSPI_RXTHRESHOLD_MASK) |
                                           VFIFO_SPI_CFGSPI_RXTHRESHOLD(handle->rxFifoThreshold));
        }
    }
}

